# Data Integration

Data integration is the process of combining data from different sources into a single, unified view. It involves merging data from multiple sources and ensuring that the data is consistent and accurate.

The need for data integration arises when organizations have data spread across multiple systems and applications, making it difficult to analyze and gain insights. For example, a company may have customer data stored in a CRM system, sales data stored in a separate database, and marketing data stored in yet another system. Integrating this data can provide a more complete picture of the business and help to identify trends and opportunities.

There are several methods for data integration, including:

- **Manual integration:** This involves manually combining data from different sources into a single dataset. It can be time-consuming and error-prone, but it may be necessary when dealing with small amounts of data or when the data sources are incompatible.
- **Application programming interface (API) integration:** This involves using APIs to extract data from different systems and integrate it into a single dataset. It can be an efficient way to integrate data, but it requires technical expertise to set up and maintain. Python's `requests` library can be used for making API calls and fetching data from data sources that provide APIs. Other libraries like `urllib` and `http.client` can also be used for this purpose.
- **ETL (extract, transform, load) integration:** This involves extracting data from different sources, transforming it to meet the needs of the target system, and loading it into a target database or data warehouse. ETL tools are commonly used to automate this process, making it more efficient and less error-prone. Python has several powerful ETL tools like `Apache Nifi`, `Apache Airflow`, and `Apache Beam`. These tools allow developers to extract data from various sources, perform transformations, and load it into a target database or data warehouse.
- **Virtual integration:** This involves creating a virtual view of the data, where data from different sources appears as if it is stored in a single database. This approach can be useful when dealing with large amounts of data or when the data sources are incompatible. Virtual integration can be achieved using tools like `Apache Drill`, `Apache Calcite`, or `Apache Ignite`. These tools provide a virtual layer over multiple data sources, enabling users to access and analyze data from multiple sources as if they were a single source.

Some of the commonly used data integration techniques include concatenation, merging, joining and stacking different datasets. Let's take a thorough look into each of those methods.

## Concatenation

Concatenation is the process of combining two or more dataframes by appending them along a particular axis. To concatenate two or more dataframes along rows or columns, you can use the `pd.concat()` function from the `pandas` library.

In [8]:
import pandas as pd

# create two sample dataframes
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [1, 2, 3]})
df2 = pd.DataFrame({'A': [4, 5, 6], 'B': [7, 8, 9]})

In [9]:
df1

   A  B  C
0  1  4  1
1  2  5  2
2  3  6  3

In [10]:
row_concat = pd.concat([df1,df2], axis = 0)
row_concat

   A  B    C
0  1  4  1.0
1  2  5  2.0
2  3  6  3.0
0  4  7  NaN
1  5  8  NaN
2  6  9  NaN

In [11]:
col_concat = pd.concat([df1,df2], axis = 1)
col_concat

   A  B  C  A  B
0  1  4  1  4  7
1  2  5  2  5  8
2  3  6  3  6  9

## Merging

Merging is the process of combining two or more dataframes based on common columns. This technique is used when the datasets have some common columns. You can use the `pd.merge()` function from the `pandas` library to merge dataframes.

In [17]:
import pandas as pd

# create two sample dataframes
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value2': [5, 6, 7, 8]})

In [18]:
print(df1)
print(df2)

  key  value1
0   A       1
1   B       2
2   C       3
3   D       4
  key  value2
0   B       5
1   D       6
2   E       7
3   F       8

In [19]:
inner = pd.merge(df1, df2, on = 'key', how='inner')
inner

  key  value1  value2
0   B       2       5
1   D       4       6

In [20]:
outer = pd.merge(df1, df2, on = 'key', how='outer')
outer

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     5.0
2   C     3.0     NaN
3   D     4.0     6.0
4   E     NaN     7.0
5   F     NaN     8.0

In [21]:
left = pd.merge(df1, df2, on = 'key', how='left')
left

  key  value1  value2
0   A       1     NaN
1   B       2     5.0
2   C       3     NaN
3   D       4     6.0

In [22]:
right = pd.merge(df1, df2, on = 'key', how='right')
right

  key  value1  value2
0   B     2.0       5
1   D     4.0       6
2   E     NaN       7
3   F     NaN       8

## Joining

Joining is similar to merging, but is specifically used to combine dataframes based on their indexes. You can use the `pd.DataFrame.join()` method to join dataframes.

In [26]:
df1.set_index("key")

     value1
key
A         1
B         2
C         3
D         4

In [25]:
df1.set_index("key").join(df2.set_index("key"), lsuffix = "_x")

     value1  value2
key
A         1     NaN
B         2     5.0
C         3     NaN
D         4     6.0

## Stacking

Stacking is the process of vertically combining datasets with the same columns. The datasets are aligned by their column names and then stacked on top of each other. You can use the `pd.stack()` function to stack a dataframe.

In [27]:
import pandas as pd

# create a dataframe to be stacked
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['X', 'Y', 'Z'])
df

   A  B
X  1  4
Y  2  5
Z  3  6

In [29]:
stacked = df.stack()
stacked

X  A    1
   B    4
Y  A    2
   B    5
Z  A    3
   B    6
dtype: int64

In [30]:
stacked.unstack()

   A  B
X  1  4
Y  2  5
Z  3  6